"Scan for Large and Old Files" = "Scansione di grandi e vecchi file";
"Erase with CleanMyMac" = "Elimina con CleanMyMac";
"Securely Erase with CleanMyMac" = "Elimina nel modo sicuro con CleanMyMac";
"Clean with CleanMyMac" = "Pulisci con CleanMyMac";
"Uninstall with CleanMyMac" = "Disinstalla con CleanMyMac";
"Clean iPhoto Library with CleanMyMac" = "Pulisci la libreria di iPhoto con CleanMyMac";
